benchmarks/artillery/sliding-window.yml
# Flagship algorithm — this is the primary benchmark for NFR-01
# Artillery: Sliding Window Counter (expect ~50% 429 at 1000 RPS with limit 500/s).
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 100
      name: Warmup
    - duration: 60
      arrivalRate: 1000
      name: Sustained
  processor: "./processor.js"
  plugins:
    expect: {}
scenarios:
  - name: Sliding window counter
    flow:
      - get:
          url: "/api/benchmark/test/sliding-window-counter"
          beforeRequest: "stampRequest"
          afterResponse: "afterResponse"
          headers:
            x-api-key: "bench-user-{{ $randomNumber(1, 50) }}"
          expect:
            - statusCode:
                - 200
                - 429